docker/deployment-init/files/create-github-idp.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:mgt="http://mgt.idp.carbon.wso2.org" xmlns:xsd="http://model.common.application.identity.carbon.wso2.org/xsd">
   <soap:Header/>
   <soap:Body>
      <mgt:addIdP>
         <!--Optional:-->
         <mgt:identityProvider>
            <xsd:alias>https://localhost:9443/oauth2/token/</xsd:alias>
            <xsd:displayName>github</xsd:displayName>
            <xsd:enable>true</xsd:enable>
            <xsd:federationHub>false</xsd:federationHub>
            <xsd:identityProviderDescription>Github Federated IDP for cellery</xsd:identityProviderDescription>
            <xsd:identityProviderName>github</xsd:identityProviderName>
            <xsd:primary>false</xsd:primary>
            <xsd:homeRealmId>github</xsd:homeRealmId>
            <xsd:claimConfig>
               <xsd:alwaysSendMappedLocalSubjectId>false</xsd:alwaysSendMappedLocalSubjectId>
               <xsd:claimMappings>
                  <xsd:localClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>http://wso2.org/claims/github-pic-url</xsd:claimUri>
                  </xsd:localClaim>
                  <xsd:mandatory>false</xsd:mandatory>
                  <xsd:remoteClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>avatar_url</xsd:claimUri>
                  </xsd:remoteClaim>
                  <xsd:requested>false</xsd:requested>
               </xsd:claimMappings>
               <xsd:claimMappings>
                  <xsd:localClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>http://wso2.org/claims/organization</xsd:claimUri>
                  </xsd:localClaim>
                  <xsd:mandatory>false</xsd:mandatory>
                  <xsd:remoteClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>company</xsd:claimUri>
                  </xsd:remoteClaim>
                  <xsd:requested>false</xsd:requested>
               </xsd:claimMappings>
               <xsd:claimMappings>
                  <xsd:localClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>http://wso2.org/claims/social/idp-common-attribute</xsd:claimUri>
                  </xsd:localClaim>
                  <xsd:mandatory>false</xsd:mandatory>
                  <xsd:remoteClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>email</xsd:claimUri>
                  </xsd:remoteClaim>
                  <xsd:requested>false</xsd:requested>
               </xsd:claimMappings>
               <xsd:claimMappings>
                  <xsd:localClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>http://wso2.org/claims/identity/social/unique/github</xsd:claimUri>
                  </xsd:localClaim>
                  <xsd:mandatory>false</xsd:mandatory>
                  <xsd:remoteClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>id</xsd:claimUri>
                  </xsd:remoteClaim>
                  <xsd:requested>false</xsd:requested>
               </xsd:claimMappings>
               <xsd:claimMappings>
                  <xsd:localClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>http://wso2.org/claims/region</xsd:claimUri>
                  </xsd:localClaim>
                  <xsd:mandatory>false</xsd:mandatory>
                  <xsd:remoteClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>location</xsd:claimUri>
                  </xsd:remoteClaim>
                  <xsd:requested>false</xsd:requested>
               </xsd:claimMappings>
               <xsd:claimMappings>
                  <xsd:localClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>http://wso2.org/claims/userid</xsd:claimUri>
                  </xsd:localClaim>
                  <xsd:mandatory>false</xsd:mandatory>
                  <xsd:remoteClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>login</xsd:claimUri>
                  </xsd:remoteClaim>
                  <xsd:requested>false</xsd:requested>
               </xsd:claimMappings>
               <xsd:claimMappings>
                  <xsd:localClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>http://wso2.org/claims/fullname</xsd:claimUri>
                  </xsd:localClaim>
                  <xsd:mandatory>false</xsd:mandatory>
                  <xsd:remoteClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>name</xsd:claimUri>
                  </xsd:remoteClaim>
                  <xsd:requested>false</xsd:requested>
               </xsd:claimMappings>
               <xsd:claimMappings>
                  <xsd:defaultValue/>
                  <xsd:localClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>http://wso2.org/claims/url</xsd:claimUri>
                  </xsd:localClaim>
                  <xsd:mandatory>false</xsd:mandatory>
                  <xsd:remoteClaim>
                     <xsd:claimId>0</xsd:claimId>
                     <xsd:claimUri>url</xsd:claimUri>
                  </xsd:remoteClaim>
                  <xsd:requested>false</xsd:requested>
               </xsd:claimMappings>
               <xsd:idpClaims>
                  <xsd:claimId>112</xsd:claimId>
                  <xsd:claimUri>avatar_url</xsd:claimUri>
               </xsd:idpClaims>
               <xsd:idpClaims>
                  <xsd:claimId>113</xsd:claimId>
                  <xsd:claimUri>company</xsd:claimUri>
               </xsd:idpClaims>
               <xsd:idpClaims>
                  <xsd:claimId>114</xsd:claimId>
                  <xsd:claimUri>email</xsd:claimUri>
               </xsd:idpClaims>
               <xsd:idpClaims>
                  <xsd:claimId>115</xsd:claimId>
                  <xsd:claimUri>id</xsd:claimUri>
               </xsd:idpClaims>
               <xsd:idpClaims>
                  <xsd:claimId>116</xsd:claimId>
                  <xsd:claimUri>location</xsd:claimUri>
               </xsd:idpClaims>
               <xsd:idpClaims>
                  <xsd:claimId>117</xsd:claimId>
                  <xsd:claimUri>login</xsd:claimUri>
               </xsd:idpClaims>
               <xsd:idpClaims>
                  <xsd:claimId>118</xsd:claimId>
                  <xsd:claimUri>name</xsd:claimUri>
               </xsd:idpClaims>
               <xsd:idpClaims>
                  <xsd:claimId>119</xsd:claimId>
                  <xsd:claimUri>url</xsd:claimUri>
               </xsd:idpClaims>
               <xsd:localClaimDialect>false</xsd:localClaimDialect>
            </xsd:claimConfig>
            <xsd:defaultAuthenticatorConfig/>
            <xsd:defaultProvisioningConnectorConfig/>
            <xsd:federatedAuthenticatorConfigs>
               <xsd:displayName>github</xsd:displayName>
               <xsd:enabled>true</xsd:enabled>
               <xsd:name>GithubAuthenticator</xsd:name>
               <xsd:properties>
                  <xsd:advanced>false</xsd:advanced>
                  <xsd:confidential>false</xsd:confidential>
                  <xsd:displayOrder>0</xsd:displayOrder>
                  <xsd:name>ClientId</xsd:name>
                  <xsd:required>false</xsd:required>
                  <xsd:value>{CELLERY_HUB_GITHUB_CLIENT_ID}</xsd:value>
               </xsd:properties>
               <xsd:properties>
                  <xsd:advanced>false</xsd:advanced>
                  <xsd:confidential>false</xsd:confidential>
                  <xsd:displayOrder>0</xsd:displayOrder>
                  <xsd:name>scope</xsd:name>
                  <xsd:required>false</xsd:required>
                  <xsd:value>read:user user:email</xsd:value>
               </xsd:properties>
               <xsd:properties>
                  <xsd:advanced>false</xsd:advanced>
                  <xsd:confidential>false</xsd:confidential>
                  <xsd:displayOrder>0</xsd:displayOrder>
                  <xsd:name>ClientSecret</xsd:name>
                  <xsd:required>false</xsd:required>
                  <xsd:value>{CELLERY_HUB_GITHUB_CLIENT_SECRET}</xsd:value>
               </xsd:properties>
               <xsd:properties>
                  <xsd:advanced>false</xsd:advanced>
                  <xsd:confidential>false</xsd:confidential>
                  <xsd:displayOrder>0</xsd:displayOrder>
                  <xsd:name>callbackUrl</xsd:name>
                  <xsd:required>false</xsd:required>
                  <xsd:value>{CELLERY_HUB_FEDERATED_CALLBACK_URL}</xsd:value>
               </xsd:properties>
            </xsd:federatedAuthenticatorConfigs>
            <xsd:justInTimeProvisioningConfig>
               <xsd:dumbMode>false</xsd:dumbMode>
               <xsd:provisioningEnabled>true</xsd:provisioningEnabled>
               <xsd:provisioningUserStore>PRIMARY</xsd:provisioningUserStore>
               <xsd:modifyUserNameAllowed>false</xsd:modifyUserNameAllowed>
               <xsd:passwordProvisioningEnabled>false</xsd:passwordProvisioningEnabled>
               <xsd:promptConsent>false</xsd:promptConsent>
               <xsd:userStoreClaimUri/>
            </xsd:justInTimeProvisioningConfig>
            <permissionAndRoleConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd"/>
         </mgt:identityProvider>
      </mgt:addIdP>
   </soap:Body>
</soap:Envelope>





